Added communication diagram
